{
  "post": [
    { "id": 1, "title": "Post 1" },
    { "id": 2, "title": "Post 2" },
    { "id": 3, "title": "Post 3" },
    { "id": 4, "title": "Post 4" }
  ],
  "comments": [
    { "id": 1, "body": "
1	Chronology
2	Background
2.1	Europe
2.2	Asia
3	Pre-war events
3.1	Italian invasion of Ethiopia (1935)
3.2	Spanish Civil War (1936–1939)
3.3	Japanese invasion of China (1937)
3.4	Soviet–Japanese border conflicts
3.5	European occupations and agreements
4	Course of the war
4.1	War breaks out in Europe (1939–40)
4.2	Western Europe (1940–41)
4.3	Mediterranean (1940–41)
4.4	Axis attack on the USSR (1941)
4.5	War breaks out in the Pacific (1941)
4.6	Axis advance stalls (1942–43)
4.7	Allies gain momentum (1943–44)
4.8	Allies close in (1944)
4.9	Axis collapse, Allied victory (1944–45)
5	Aftermath
6	Impact
6.1	Casualties and war crimes
6.2	Genocide, concentration camps, and slave labour
6.3	Occupation
6.4	Home fronts and production
6.5	Advances in technology and warfare
7	See also
8	Notes
9	Citations
10	References
11	External links
Chronology
See also: Timeline of World War II
Timelines of World War II
Chronological
Prelude
(in Asiain Europe)
1939 1940 1941 1942
1943 1944 1945 onwards
By topic
Diplomacy
Declarations of war
EngagementsOperations
Battle of Europe air operations
Eastern FrontManhattan Project
United Kingdom home front
Surrender of the Axis armies
vte
The start of the war in Europe is generally held to be 1 September 1939,[9][10] beginning with the German invasion of Poland; the United Kingdom and France declared war on Germany two days later. The dates for the beginning of war in the Pacific include the start of the Second Sino-Japanese War on 7 July 1937,[11][12] or even the Japanese invasion of Manchuria on 19 September 1931.[13][14]

Others follow the British historian A. J. P. Taylor, who held that the Sino-Japanese War and war in Europe and its colonies occurred simultaneously, and the two wars merged in 1941. This article uses the conventional dating. Other starting dates sometimes used for World War II include the Italian invasion of Abyssinia on 3 October 1935.[15] The British historian Antony Beevor views the beginning of World War II as the Battles of Khalkhin Gol fought between Japan and the forces of Mongolia and the Soviet Union from May to September 1939.[16]

The exact date of the war's end is also not universally agreed upon. It was generally accepted at the time that the war ended with the armistice of 14 August 1945 (V-J Day), rather than the formal surrender of Japan, which was on 2 September 1945 that officially ended the war in Asia. A peace treaty with Japan was signed in 1951.[17] A treaty regarding Germany's future allowed the reunification of East and West Germany to take place in 1990 and resolved most post-World War II issues.[18] A formal peace treaty between Japan and the USSR had never been signed.[19]

Background
Main article: Causes of World War II
Europe
World War I had radically altered the political European map, with the defeat of the Central Powers—including Austria-Hungary, Germany, Bulgaria and the Ottoman Empire—and the 1917 Bolshevik seizure of power in Russia, which eventually led to the founding of the Soviet Union. Meanwhile, the victorious Allies of World War I, such as France, Belgium, Italy, Romania and Greece, gained territory, and new nation-states were created out of the collapse of Austria-Hungary and the Ottoman and Russian Empires.


The League of Nations assembly, held in Geneva, Switzerland, 1930
To prevent a future world war, the League of Nations was created during the 1919 Paris Peace Conference. The organisation's primary goals were to prevent armed conflict through collective security, military and naval disarmament, and settling international disputes through peaceful negotiations and arbitration.

Despite strong pacifist sentiment after World War I,[20] its aftermath still caused irredentist and revanchist nationalism in several European states. These sentiments were especially marked in Germany because of the significant territorial, colonial, and financial losses incurred by the Treaty of Versailles. Under the treaty, Germany lost around 13 percent of its home territory and all of its overseas possessions, while German annexation of other states was prohibited, reparations were imposed, and limits were placed on the size and capability of the country's armed forces.[21]


Adolf Hitler at a German National Socialist political rally in Nürnberg, August 1933
The German Empire was dissolved in the German Revolution of 1918–1919, and a democratic government, later known as the Weimar Republic, was created. The interwar period saw strife between supporters of the new republic and hardline opponents on both the right and left. Italy, as an Entente ally, had made some post-war territorial gains; however, Italian nationalists were angered that the promises made by Britain and France to secure Italian entrance into the war were not fulfilled in the peace settlement. From 1922 to 1925, the Fascist movement led by Benito Mussolini seized power in Italy with a nationalist, totalitarian, and class collaborationist agenda that abolished representative democracy, repressed socialist, left-wing and liberal forces, and pursued an aggressive expansionist foreign policy aimed at making Italy a world power, promising the creation of a emp_testNew Roman Empireemp_test.[22]

Adolf Hitler, after an unsuccessful attempt to overthrow the German government in 1923, eventually became the Chancellor of Germany in 1933. He abolished democracy, espousing a radical, racially motivated revision of the world order, and soon began a massive rearmament campaign.[23] Meanwhile, France, to secure its alliance, allowed Italy a free hand in Ethiopia, which Italy desired as a colonial possession. The situation was aggravated in early 1935 when the Territory of the Saar Basin was legally reunited with Germany and Hitler repudiated the Treaty of Versailles, accelerated his rearmament programme, and introduced conscription.[24]

To contain Germany, the United Kingdom, France and Italy formed the Stresa Front in April 1935; however, that June, the United Kingdom made an independent naval agreement with Germany, easing prior restrictions. The Soviet Union, concerned by Germany's goals of capturing vast areas of Eastern Europe, drafted a treaty of mutual assistance with France. Before taking effect though, the Franco-Soviet pact was required to go through the bureaucracy of the League of Nations, which rendered it essentially toothless.[25] The United States, concerned with events in Europe and Asia, passed the Neutrality Act in August of the same year.[26]

Hitler defied the Versailles and Locarno treaties by remilitarising the Rhineland in March 1936, encountering little opposition.[27] In October 1936, Germany and Italy formed the Rome–Berlin Axis. A month later, Germany and Japan signed the Anti-Comintern Pact, which Italy would join in the following year.

Asia
The Kuomintang (KMT) party in China launched a unification campaign against regional warlords and nominally unified China in the mid-1920s, but was soon embroiled in a civil war against its former Chinese Communist Party allies[28] and new regional warlords. In 1931, an increasingly militaristic Empire of Japan, which had long sought influence in China[29] as the first step of what its government saw as the country's right to rule Asia, used the Mukden Incident as a pretext to launch an invasion of Manchuria and establish the puppet state of Manchukuo.[30]

Too weak to resist Japan, China appealed to the League of Nations for help. Japan withdrew from the League of Nations after being condemned for its incursion into Manchuria. The two nations then fought several battles, in Shanghai, Rehe and Hebei, until the Tanggu Truce was signed in 1933. Thereafter, Chinese volunteer forces continued the resistance to Japanese aggression in Manchuria, and Chahar and Suiyuan.[31] After the 1936 Xi'an Incident, the Kuomintang and communist forces agreed on a ceasefire to present a united front to oppose Japan.[32]

Pre-war events
Italian invasion of Ethiopia (1935)
Main article: Second Italo-Ethiopian War

Benito Mussolini inspecting troops during the Italo-Ethiopian War, 1935
The Second Italo–Ethiopian War was a brief colonial war that began in October 1935 and ended in May 1936. The war began with the invasion of the Ethiopian Empire (also known as Abyssinia) by the armed forces of the Kingdom of Italy (Regno d'Italia), which was launched from Italian Somaliland and Eritrea.[33] The war resulted in the military occupation of Ethiopia and its annexation into the newly created colony of Italian East Africa (Africa Orientale Italiana, or AOI); in addition it exposed the weakness of the League of Nations as a force to preserve peace. Both Italy and Ethiopia were member nations, but the League did nothing when the former clearly violated the League's Article X.[34] Germany was the only major European nation to openly support the invasion.[citation needed] Italy subsequently dropped its objections to Germany's goal of absorbing Austria.[35]

Spanish Civil War (1936–1939)
Main article: Spanish Civil War

The bombing of Guernica in 1937, during the Spanish Civil War, sparked Europe-wide fears that the next war would be based on bombing of cities with very high civilian casualties
When civil war broke out in Spain, Hitler and Mussolini lent military support to the Nationalist rebels, led by General Francisco Franco. The Soviet Union supported the existing government, the Spanish Republic. Over 30,000 foreign volunteers, known as the International Brigades, also fought against the Nationalists. Both Germany and the USSR used this proxy war as an opportunity to test in combat their most advanced weapons and tactics. The Nationalists won the civil war in April 1939; Franco, now dictator, remained officially neutral during World War II but generally favoured the Axis.[36] His greatest collaboration with Germany was the sending of volunteers to fight on the Eastern Front.[37]

Japanese invasion of China (1937)
Main article: Second Sino-Japanese War

Japanese Imperial Army soldiers during the Battle of Shanghai, 1937
In July 1937, Japan captured the former Chinese imperial capital of Peking after instigating the Marco Polo Bridge Incident, which culminated in the Japanese campaign to invade all of China.[38] The Soviets quickly signed a non-aggression pact with China to lend materiel support, effectively ending China's prior co-operation with Germany. From September to November, the Japanese attacked Taiyuan,[39][40] as well as engaging the Kuomintang Army around Xinkou[39][40] and Communist forces in Pingxingguan.[41][42] Generalissimo Chiang Kai-shek deployed his best army to defend Shanghai, but, after three months of fighting, Shanghai fell. The Japanese continued to push the Chinese forces back, capturing the capital Nanking in December 1937. After the fall of Nanking, tens of thousands if not hundreds of thousands of Chinese civilians and disarmed combatants were murdered by the Japanese.[43][44]

In March 1938, Nationalist Chinese forces won their first major victory at Taierzhuang but then the city of Xuzhou was taken by Japanese in May.[45] In June 1938, Chinese forces stalled the Japanese advance by flooding the Yellow River; this manoeuvre bought time for the Chinese to prepare their defences at Wuhan, but the city was taken by October.[46] Japanese military victories did not bring about the collapse of Chinese resistance that Japan had hoped to achieve; instead the Chinese government relocated inland to Chongqing and continued the war.[47][48]

Soviet–Japanese border conflicts

Red Army artillery unit during the Battle of Lake Khasan, 1938
Main article: Soviet–Japanese border conflicts
In the mid-to-late 1930s, Japanese forces in Manchukuo had sporadic border clashes with the Soviet Union and the Mongolian People's Republic. The Japanese doctrine of Hokushin-ron, which emphasised Japan's expansion northward, was favoured by the Imperial Army during this time. With the Japanese defeat at Khalkin Gol in 1939, the ongoing Second Sino-Japanese War[49] and ally Nazi Germany pursuing neutrality with the Soviets, this policy would prove difficult to maintain. Japan and the Soviet Union eventually signed a Neutrality Pact in April 1941, and Japan adopted the doctrine of Nanshin-ron, promoted by the Navy, which took its focus southward, eventually leading to its war with the United States and the Western Allies.[50][51]

1	Chronology
2	Background
2.1	Europe
2.2	Asia
3	Pre-war events
3.1	Italian invasion of Ethiopia (1935)
3.2	Spanish Civil War (1936–1939)
3.3	Japanese invasion of China (1937)
3.4	Soviet–Japanese border conflicts
3.5	European occupations and agreements
4	Course of the war
4.1	War breaks out in Europe (1939–40)
4.2	Western Europe (1940–41)
4.3	Mediterranean (1940–41)
4.4	Axis attack on the USSR (1941)
4.5	War breaks out in the Pacific (1941)
4.6	Axis advance stalls (1942–43)
4.7	Allies gain momentum (1943–44)
4.8	Allies close in (1944)
4.9	Axis collapse, Allied victory (1944–45)
5	Aftermath
6	Impact
6.1	Casualties and war crimes
6.2	Genocide, concentration camps, and slave labour
6.3	Occupation
6.4	Home fronts and production
6.5	Advances in technology and warfare
7	See also
8	Notes
9	Citations
10	References
11	External links
Chronology
See also: Timeline of World War II
Timelines of World War II
Chronological
Prelude
(in Asiain Europe)
1939 1940 1941 1942
1943 1944 1945 onwards
By topic
Diplomacy
Declarations of war
EngagementsOperations
Battle of Europe air operations
Eastern FrontManhattan Project
United Kingdom home front
Surrender of the Axis armies
vte
The start of the war in Europe is generally held to be 1 September 1939,[9][10] beginning with the German invasion of Poland; the United Kingdom and France declared war on Germany two days later. The dates for the beginning of war in the Pacific include the start of the Second Sino-Japanese War on 7 July 1937,[11][12] or even the Japanese invasion of Manchuria on 19 September 1931.[13][14]

Others follow the British historian A. J. P. Taylor, who held that the Sino-Japanese War and war in Europe and its colonies occurred simultaneously, and the two wars merged in 1941. This article uses the conventional dating. Other starting dates sometimes used for World War II include the Italian invasion of Abyssinia on 3 October 1935.[15] The British historian Antony Beevor views the beginning of World War II as the Battles of Khalkhin Gol fought between Japan and the forces of Mongolia and the Soviet Union from May to September 1939.[16]

The exact date of the war's end is also not universally agreed upon. It was generally accepted at the time that the war ended with the armistice of 14 August 1945 (V-J Day), rather than the formal surrender of Japan, which was on 2 September 1945 that officially ended the war in Asia. A peace treaty with Japan was signed in 1951.[17] A treaty regarding Germany's future allowed the reunification of East and West Germany to take place in 1990 and resolved most post-World War II issues.[18] A formal peace treaty between Japan and the USSR had never been signed.[19]

Background
Main article: Causes of World War II
Europe
World War I had radically altered the political European map, with the defeat of the Central Powers—including Austria-Hungary, Germany, Bulgaria and the Ottoman Empire—and the 1917 Bolshevik seizure of power in Russia, which eventually led to the founding of the Soviet Union. Meanwhile, the victorious Allies of World War I, such as France, Belgium, Italy, Romania and Greece, gained territory, and new nation-states were created out of the collapse of Austria-Hungary and the Ottoman and Russian Empires.


The League of Nations assembly, held in Geneva, Switzerland, 1930
To prevent a future world war, the League of Nations was created during the 1919 Paris Peace Conference. The organisation's primary goals were to prevent armed conflict through collective security, military and naval disarmament, and settling international disputes through peaceful negotiations and arbitration.

Despite strong pacifist sentiment after World War I,[20] its aftermath still caused irredentist and revanchist nationalism in several European states. These sentiments were especially marked in Germany because of the significant territorial, colonial, and financial losses incurred by the Treaty of Versailles. Under the treaty, Germany lost around 13 percent of its home territory and all of its overseas possessions, while German annexation of other states was prohibited, reparations were imposed, and limits were placed on the size and capability of the country's armed forces.[21]


Adolf Hitler at a German National Socialist political rally in Nürnberg, August 1933
The German Empire was dissolved in the German Revolution of 1918–1919, and a democratic government, later known as the Weimar Republic, was created. The interwar period saw strife between supporters of the new republic and hardline opponents on both the right and left. Italy, as an Entente ally, had made some post-war territorial gains; however, Italian nationalists were angered that the promises made by Britain and France to secure Italian entrance into the war were not fulfilled in the peace settlement. From 1922 to 1925, the Fascist movement led by Benito Mussolini seized power in Italy with a nationalist, totalitarian, and class collaborationist agenda that abolished representative democracy, repressed socialist, left-wing and liberal forces, and pursued an aggressive expansionist foreign policy aimed at making Italy a world power, promising the creation of a emp_testNew Roman Empireemp_test.[22]

Adolf Hitler, after an unsuccessful attempt to overthrow the German government in 1923, eventually became the Chancellor of Germany in 1933. He abolished democracy, espousing a radical, racially motivated revision of the world order, and soon began a massive rearmament campaign.[23] Meanwhile, France, to secure its alliance, allowed Italy a free hand in Ethiopia, which Italy desired as a colonial possession. The situation was aggravated in early 1935 when the Territory of the Saar Basin was legally reunited with Germany and Hitler repudiated the Treaty of Versailles, accelerated his rearmament programme, and introduced conscription.[24]

To contain Germany, the United Kingdom, France and Italy formed the Stresa Front in April 1935; however, that June, the United Kingdom made an independent naval agreement with Germany, easing prior restrictions. The Soviet Union, concerned by Germany's goals of capturing vast areas of Eastern Europe, drafted a treaty of mutual assistance with France. Before taking effect though, the Franco-Soviet pact was required to go through the bureaucracy of the League of Nations, which rendered it essentially toothless.[25] The United States, concerned with events in Europe and Asia, passed the Neutrality Act in August of the same year.[26]

Hitler defied the Versailles and Locarno treaties by remilitarising the Rhineland in March 1936, encountering little opposition.[27] In October 1936, Germany and Italy formed the Rome–Berlin Axis. A month later, Germany and Japan signed the Anti-Comintern Pact, which Italy would join in the following year.

Asia
The Kuomintang (KMT) party in China launched a unification campaign against regional warlords and nominally unified China in the mid-1920s, but was soon embroiled in a civil war against its former Chinese Communist Party allies[28] and new regional warlords. In 1931, an increasingly militaristic Empire of Japan, which had long sought influence in China[29] as the first step of what its government saw as the country's right to rule Asia, used the Mukden Incident as a pretext to launch an invasion of Manchuria and establish the puppet state of Manchukuo.[30]

Too weak to resist Japan, China appealed to the League of Nations for help. Japan withdrew from the League of Nations after being condemned for its incursion into Manchuria. The two nations then fought several battles, in Shanghai, Rehe and Hebei, until the Tanggu Truce was signed in 1933. Thereafter, Chinese volunteer forces continued the resistance to Japanese aggression in Manchuria, and Chahar and Suiyuan.[31] After the 1936 Xi'an Incident, the Kuomintang and communist forces agreed on a ceasefire to present a united front to oppose Japan.[32]

Pre-war events
Italian invasion of Ethiopia (1935)
Main article: Second Italo-Ethiopian War

Benito Mussolini inspecting troops during the Italo-Ethiopian War, 1935
The Second Italo–Ethiopian War was a brief colonial war that began in October 1935 and ended in May 1936. The war began with the invasion of the Ethiopian Empire (also known as Abyssinia) by the armed forces of the Kingdom of Italy (Regno d'Italia), which was launched from Italian Somaliland and Eritrea.[33] The war resulted in the military occupation of Ethiopia and its annexation into the newly created colony of Italian East Africa (Africa Orientale Italiana, or AOI); in addition it exposed the weakness of the League of Nations as a force to preserve peace. Both Italy and Ethiopia were member nations, but the League did nothing when the former clearly violated the League's Article X.[34] Germany was the only major European nation to openly support the invasion.[citation needed] Italy subsequently dropped its objections to Germany's goal of absorbing Austria.[35]

Spanish Civil War (1936–1939)
Main article: Spanish Civil War

The bombing of Guernica in 1937, during the Spanish Civil War, sparked Europe-wide fears that the next war would be based on bombing of cities with very high civilian casualties
When civil war broke out in Spain, Hitler and Mussolini lent military support to the Nationalist rebels, led by General Francisco Franco. The Soviet Union supported the existing government, the Spanish Republic. Over 30,000 foreign volunteers, known as the International Brigades, also fought against the Nationalists. Both Germany and the USSR used this proxy war as an opportunity to test in combat their most advanced weapons and tactics. The Nationalists won the civil war in April 1939; Franco, now dictator, remained officially neutral during World War II but generally favoured the Axis.[36] His greatest collaboration with Germany was the sending of volunteers to fight on the Eastern Front.[37]

Japanese invasion of China (1937)
Main article: Second Sino-Japanese War

Japanese Imperial Army soldiers during the Battle of Shanghai, 1937
In July 1937, Japan captured the former Chinese imperial capital of Peking after instigating the Marco Polo Bridge Incident, which culminated in the Japanese campaign to invade all of China.[38] The Soviets quickly signed a non-aggression pact with China to lend materiel support, effectively ending China's prior co-operation with Germany. From September to November, the Japanese attacked Taiyuan,[39][40] as well as engaging the Kuomintang Army around Xinkou[39][40] and Communist forces in Pingxingguan.[41][42] Generalissimo Chiang Kai-shek deployed his best army to defend Shanghai, but, after three months of fighting, Shanghai fell. The Japanese continued to push the Chinese forces back, capturing the capital Nanking in December 1937. After the fall of Nanking, tens of thousands if not hundreds of thousands of Chinese civilians and disarmed combatants were murdered by the Japanese.[43][44]

In March 1938, Nationalist Chinese forces won their first major victory at Taierzhuang but then the city of Xuzhou was taken by Japanese in May.[45] In June 1938, Chinese forces stalled the Japanese advance by flooding the Yellow River; this manoeuvre bought time for the Chinese to prepare their defences at Wuhan, but the city was taken by October.[46] Japanese military victories did not bring about the collapse of Chinese resistance that Japan had hoped to achieve; instead the Chinese government relocated inland to Chongqing and continued the war.[47][48]

Soviet–Japanese border conflicts

Red Army artillery unit during the Battle of Lake Khasan, 1938
Main article: Soviet–Japanese border conflicts
In the mid-to-late 1930s, Japanese forces in Manchukuo had sporadic border clashes with the Soviet Union and the Mongolian People's Republic. The Japanese doctrine of Hokushin-ron, which emphasised Japan's expansion northward, was favoured by the Imperial Army during this time. With the Japanese defeat at Khalkin Gol in 1939, the ongoing Second Sino-Japanese War[49] and ally Nazi Germany pursuing neutrality with the Soviets, this policy would prove difficult to maintain. Japan and the Soviet Union eventually signed a Neutrality Pact in April 1941, and Japan adopted the doctrine of Nanshin-ron, promoted by the Navy, which took its focus southward, eventually leading to its war with the United States and the Western Allies.[50][51]

1	Chronology
2	Background
2.1	Europe
2.2	Asia
3	Pre-war events
3.1	Italian invasion of Ethiopia (1935)
3.2	Spanish Civil War (1936–1939)
3.3	Japanese invasion of China (1937)
3.4	Soviet–Japanese border conflicts
3.5	European occupations and agreements
4	Course of the war
4.1	War breaks out in Europe (1939–40)
4.2	Western Europe (1940–41)
4.3	Mediterranean (1940–41)
4.4	Axis attack on the USSR (1941)
4.5	War breaks out in the Pacific (1941)
4.6	Axis advance stalls (1942–43)
4.7	Allies gain momentum (1943–44)
4.8	Allies close in (1944)
4.9	Axis collapse, Allied victory (1944–45)
5	Aftermath
6	Impact
6.1	Casualties and war crimes
6.2	Genocide, concentration camps, and slave labour
6.3	Occupation
6.4	Home fronts and production
6.5	Advances in technology and warfare
7	See also
8	Notes
9	Citations
10	References
11	External links
Chronology
See also: Timeline of World War II
Timelines of World War II
Chronological
Prelude
(in Asiain Europe)
1939 1940 1941 1942
1943 1944 1945 onwards
By topic
Diplomacy
Declarations of war
EngagementsOperations
Battle of Europe air operations
Eastern FrontManhattan Project
United Kingdom home front
Surrender of the Axis armies
vte
The start of the war in Europe is generally held to be 1 September 1939,[9][10] beginning with the German invasion of Poland; the United Kingdom and France declared war on Germany two days later. The dates for the beginning of war in the Pacific include the start of the Second Sino-Japanese War on 7 July 1937,[11][12] or even the Japanese invasion of Manchuria on 19 September 1931.[13][14]

Others follow the British historian A. J. P. Taylor, who held that the Sino-Japanese War and war in Europe and its colonies occurred simultaneously, and the two wars merged in 1941. This article uses the conventional dating. Other starting dates sometimes used for World War II include the Italian invasion of Abyssinia on 3 October 1935.[15] The British historian Antony Beevor views the beginning of World War II as the Battles of Khalkhin Gol fought between Japan and the forces of Mongolia and the Soviet Union from May to September 1939.[16]

The exact date of the war's end is also not universally agreed upon. It was generally accepted at the time that the war ended with the armistice of 14 August 1945 (V-J Day), rather than the formal surrender of Japan, which was on 2 September 1945 that officially ended the war in Asia. A peace treaty with Japan was signed in 1951.[17] A treaty regarding Germany's future allowed the reunification of East and West Germany to take place in 1990 and resolved most post-World War II issues.[18] A formal peace treaty between Japan and the USSR had never been signed.[19]

Background
Main article: Causes of World War II
Europe
World War I had radically altered the political European map, with the defeat of the Central Powers—including Austria-Hungary, Germany, Bulgaria and the Ottoman Empire—and the 1917 Bolshevik seizure of power in Russia, which eventually led to the founding of the Soviet Union. Meanwhile, the victorious Allies of World War I, such as France, Belgium, Italy, Romania and Greece, gained territory, and new nation-states were created out of the collapse of Austria-Hungary and the Ottoman and Russian Empires.


The League of Nations assembly, held in Geneva, Switzerland, 1930
To prevent a future world war, the League of Nations was created during the 1919 Paris Peace Conference. The organisation's primary goals were to prevent armed conflict through collective security, military and naval disarmament, and settling international disputes through peaceful negotiations and arbitration.

Despite strong pacifist sentiment after World War I,[20] its aftermath still caused irredentist and revanchist nationalism in several European states. These sentiments were especially marked in Germany because of the significant territorial, colonial, and financial losses incurred by the Treaty of Versailles. Under the treaty, Germany lost around 13 percent of its home territory and all of its overseas possessions, while German annexation of other states was prohibited, reparations were imposed, and limits were placed on the size and capability of the country's armed forces.[21]


Adolf Hitler at a German National Socialist political rally in Nürnberg, August 1933
The German Empire was dissolved in the German Revolution of 1918–1919, and a democratic government, later known as the Weimar Republic, was created. The interwar period saw strife between supporters of the new republic and hardline opponents on both the right and left. Italy, as an Entente ally, had made some post-war territorial gains; however, Italian nationalists were angered that the promises made by Britain and France to secure Italian entrance into the war were not fulfilled in the peace settlement. From 1922 to 1925, the Fascist movement led by Benito Mussolini seized power in Italy with a nationalist, totalitarian, and class collaborationist agenda that abolished representative democracy, repressed socialist, left-wing and liberal forces, and pursued an aggressive expansionist foreign policy aimed at making Italy a world power, promising the creation of a emp_testNew Roman Empireemp_test.[22]

Adolf Hitler, after an unsuccessful attempt to overthrow the German government in 1923, eventually became the Chancellor of Germany in 1933. He abolished democracy, espousing a radical, racially motivated revision of the world order, and soon began a massive rearmament campaign.[23] Meanwhile, France, to secure its alliance, allowed Italy a free hand in Ethiopia, which Italy desired as a colonial possession. The situation was aggravated in early 1935 when the Territory of the Saar Basin was legally reunited with Germany and Hitler repudiated the Treaty of Versailles, accelerated his rearmament programme, and introduced conscription.[24]

To contain Germany, the United Kingdom, France and Italy formed the Stresa Front in April 1935; however, that June, the United Kingdom made an independent naval agreement with Germany, easing prior restrictions. The Soviet Union, concerned by Germany's goals of capturing vast areas of Eastern Europe, drafted a treaty of mutual assistance with France. Before taking effect though, the Franco-Soviet pact was required to go through the bureaucracy of the League of Nations, which rendered it essentially toothless.[25] The United States, concerned with events in Europe and Asia, passed the Neutrality Act in August of the same year.[26]

Hitler defied the Versailles and Locarno treaties by remilitarising the Rhineland in March 1936, encountering little opposition.[27] In October 1936, Germany and Italy formed the Rome–Berlin Axis. A month later, Germany and Japan signed the Anti-Comintern Pact, which Italy would join in the following year.

Asia
The Kuomintang (KMT) party in China launched a unification campaign against regional warlords and nominally unified China in the mid-1920s, but was soon embroiled in a civil war against its former Chinese Communist Party allies[28] and new regional warlords. In 1931, an increasingly militaristic Empire of Japan, which had long sought influence in China[29] as the first step of what its government saw as the country's right to rule Asia, used the Mukden Incident as a pretext to launch an invasion of Manchuria and establish the puppet state of Manchukuo.[30]

Too weak to resist Japan, China appealed to the League of Nations for help. Japan withdrew from the League of Nations after being condemned for its incursion into Manchuria. The two nations then fought several battles, in Shanghai, Rehe and Hebei, until the Tanggu Truce was signed in 1933. Thereafter, Chinese volunteer forces continued the resistance to Japanese aggression in Manchuria, and Chahar and Suiyuan.[31] After the 1936 Xi'an Incident, the Kuomintang and communist forces agreed on a ceasefire to present a united front to oppose Japan.[32]

Pre-war events
Italian invasion of Ethiopia (1935)
Main article: Second Italo-Ethiopian War

Benito Mussolini inspecting troops during the Italo-Ethiopian War, 1935
The Second Italo–Ethiopian War was a brief colonial war that began in October 1935 and ended in May 1936. The war began with the invasion of the Ethiopian Empire (also known as Abyssinia) by the armed forces of the Kingdom of Italy (Regno d'Italia), which was launched from Italian Somaliland and Eritrea.[33] The war resulted in the military occupation of Ethiopia and its annexation into the newly created colony of Italian East Africa (Africa Orientale Italiana, or AOI); in addition it exposed the weakness of the League of Nations as a force to preserve peace. Both Italy and Ethiopia were member nations, but the League did nothing when the former clearly violated the League's Article X.[34] Germany was the only major European nation to openly support the invasion.[citation needed] Italy subsequently dropped its objections to Germany's goal of absorbing Austria.[35]

Spanish Civil War (1936–1939)
Main article: Spanish Civil War

The bombing of Guernica in 1937, during the Spanish Civil War, sparked Europe-wide fears that the next war would be based on bombing of cities with very high civilian casualties
When civil war broke out in Spain, Hitler and Mussolini lent military support to the Nationalist rebels, led by General Francisco Franco. The Soviet Union supported the existing government, the Spanish Republic. Over 30,000 foreign volunteers, known as the International Brigades, also fought against the Nationalists. Both Germany and the USSR used this proxy war as an opportunity to test in combat their most advanced weapons and tactics. The Nationalists won the civil war in April 1939; Franco, now dictator, remained officially neutral during World War II but generally favoured the Axis.[36] His greatest collaboration with Germany was the sending of volunteers to fight on the Eastern Front.[37]

Japanese invasion of China (1937)
Main article: Second Sino-Japanese War

Japanese Imperial Army soldiers during the Battle of Shanghai, 1937
In July 1937, Japan captured the former Chinese imperial capital of Peking after instigating the Marco Polo Bridge Incident, which culminated in the Japanese campaign to invade all of China.[38] The Soviets quickly signed a non-aggression pact with China to lend materiel support, effectively ending China's prior co-operation with Germany. From September to November, the Japanese attacked Taiyuan,[39][40] as well as engaging the Kuomintang Army around Xinkou[39][40] and Communist forces in Pingxingguan.[41][42] Generalissimo Chiang Kai-shek deployed his best army to defend Shanghai, but, after three months of fighting, Shanghai fell. The Japanese continued to push the Chinese forces back, capturing the capital Nanking in December 1937. After the fall of Nanking, tens of thousands if not hundreds of thousands of Chinese civilians and disarmed combatants were murdered by the Japanese.[43][44]

In March 1938, Nationalist Chinese forces won their first major victory at Taierzhuang but then the city of Xuzhou was taken by Japanese in May.[45] In June 1938, Chinese forces stalled the Japanese advance by flooding the Yellow River; this manoeuvre bought time for the Chinese to prepare their defences at Wuhan, but the city was taken by October.[46] Japanese military victories did not bring about the collapse of Chinese resistance that Japan had hoped to achieve; instead the Chinese government relocated inland to Chongqing and continued the war.[47][48]

Soviet–Japanese border conflicts

Red Army artillery unit during the Battle of Lake Khasan, 1938
Main article: Soviet–Japanese border conflicts
In the mid-to-late 1930s, Japanese forces in Manchukuo had sporadic border clashes with the Soviet Union and the Mongolian People's Republic. The Japanese doctrine of Hokushin-ron, which emphasised Japan's expansion northward, was favoured by the Imperial Army during this time. With the Japanese defeat at Khalkin Gol in 1939, the ongoing Second Sino-Japanese War[49] and ally Nazi Germany pursuing neutrality with the Soviets, this policy would prove difficult to maintain. Japan and the Soviet Union eventually signed a Neutrality Pact in April 1941, and Japan adopted the doctrine of Nanshin-ron, promoted by the Navy, which took its focus southward, eventually leading to its war with the United States and the Western Allies.[50][51]

1	Chronology
2	Background
2.1	Europe
2.2	Asia
3	Pre-war events
3.1	Italian invasion of Ethiopia (1935)
3.2	Spanish Civil War (1936–1939)
3.3	Japanese invasion of China (1937)
3.4	Soviet–Japanese border conflicts
3.5	European occupations and agreements
4	Course of the war
4.1	War breaks out in Europe (1939–40)
4.2	Western Europe (1940–41)
4.3	Mediterranean (1940–41)
4.4	Axis attack on the USSR (1941)
4.5	War breaks out in the Pacific (1941)
4.6	Axis advance stalls (1942–43)
4.7	Allies gain momentum (1943–44)
4.8	Allies close in (1944)
4.9	Axis collapse, Allied victory (1944–45)
5	Aftermath
6	Impact
6.1	Casualties and war crimes
6.2	Genocide, concentration camps, and slave labour
6.3	Occupation
6.4	Home fronts and production
6.5	Advances in technology and warfare
7	See also
8	Notes
9	Citations
10	References
11	External links
Chronology
See also: Timeline of World War II
Timelines of World War II
Chronological
Prelude
(in Asiain Europe)
1939 1940 1941 1942
1943 1944 1945 onwards
By topic
Diplomacy
Declarations of war
EngagementsOperations
Battle of Europe air operations
Eastern FrontManhattan Project
United Kingdom home front
Surrender of the Axis armies
vte
The start of the war in Europe is generally held to be 1 September 1939,[9][10] beginning with the German invasion of Poland; the United Kingdom and France declared war on Germany two days later. The dates for the beginning of war in the Pacific include the start of the Second Sino-Japanese War on 7 July 1937,[11][12] or even the Japanese invasion of Manchuria on 19 September 1931.[13][14]

Others follow the British historian A. J. P. Taylor, who held that the Sino-Japanese War and war in Europe and its colonies occurred simultaneously, and the two wars merged in 1941. This article uses the conventional dating. Other starting dates sometimes used for World War II include the Italian invasion of Abyssinia on 3 October 1935.[15] The British historian Antony Beevor views the beginning of World War II as the Battles of Khalkhin Gol fought between Japan and the forces of Mongolia and the Soviet Union from May to September 1939.[16]

The exact date of the war's end is also not universally agreed upon. It was generally accepted at the time that the war ended with the armistice of 14 August 1945 (V-J Day), rather than the formal surrender of Japan, which was on 2 September 1945 that officially ended the war in Asia. A peace treaty with Japan was signed in 1951.[17] A treaty regarding Germany's future allowed the reunification of East and West Germany to take place in 1990 and resolved most post-World War II issues.[18] A formal peace treaty between Japan and the USSR had never been signed.[19]

Background
Main article: Causes of World War II
Europe
World War I had radically altered the political European map, with the defeat of the Central Powers—including Austria-Hungary, Germany, Bulgaria and the Ottoman Empire—and the 1917 Bolshevik seizure of power in Russia, which eventually led to the founding of the Soviet Union. Meanwhile, the victorious Allies of World War I, such as France, Belgium, Italy, Romania and Greece, gained territory, and new nation-states were created out of the collapse of Austria-Hungary and the Ottoman and Russian Empires.


The League of Nations assembly, held in Geneva, Switzerland, 1930
To prevent a future world war, the League of Nations was created during the 1919 Paris Peace Conference. The organisation's primary goals were to prevent armed conflict through collective security, military and naval disarmament, and settling international disputes through peaceful negotiations and arbitration.

Despite strong pacifist sentiment after World War I,[20] its aftermath still caused irredentist and revanchist nationalism in several European states. These sentiments were especially marked in Germany because of the significant territorial, colonial, and financial losses incurred by the Treaty of Versailles. Under the treaty, Germany lost around 13 percent of its home territory and all of its overseas possessions, while German annexation of other states was prohibited, reparations were imposed, and limits were placed on the size and capability of the country's armed forces.[21]


Adolf Hitler at a German National Socialist political rally in Nürnberg, August 1933
The German Empire was dissolved in the German Revolution of 1918–1919, and a democratic government, later known as the Weimar Republic, was created. The interwar period saw strife between supporters of the new republic and hardline opponents on both the right and left. Italy, as an Entente ally, had made some post-war territorial gains; however, Italian nationalists were angered that the promises made by Britain and France to secure Italian entrance into the war were not fulfilled in the peace settlement. From 1922 to 1925, the Fascist movement led by Benito Mussolini seized power in Italy with a nationalist, totalitarian, and class collaborationist agenda that abolished representative democracy, repressed socialist, left-wing and liberal forces, and pursued an aggressive expansionist foreign policy aimed at making Italy a world power, promising the creation of a emp_testNew Roman Empireemp_test.[22]

Adolf Hitler, after an unsuccessful attempt to overthrow the German government in 1923, eventually became the Chancellor of Germany in 1933. He abolished democracy, espousing a radical, racially motivated revision of the world order, and soon began a massive rearmament campaign.[23] Meanwhile, France, to secure its alliance, allowed Italy a free hand in Ethiopia, which Italy desired as a colonial possession. The situation was aggravated in early 1935 when the Territory of the Saar Basin was legally reunited with Germany and Hitler repudiated the Treaty of Versailles, accelerated his rearmament programme, and introduced conscription.[24]

To contain Germany, the United Kingdom, France and Italy formed the Stresa Front in April 1935; however, that June, the United Kingdom made an independent naval agreement with Germany, easing prior restrictions. The Soviet Union, concerned by Germany's goals of capturing vast areas of Eastern Europe, drafted a treaty of mutual assistance with France. Before taking effect though, the Franco-Soviet pact was required to go through the bureaucracy of the League of Nations, which rendered it essentially toothless.[25] The United States, concerned with events in Europe and Asia, passed the Neutrality Act in August of the same year.[26]

Hitler defied the Versailles and Locarno treaties by remilitarising the Rhineland in March 1936, encountering little opposition.[27] In October 1936, Germany and Italy formed the Rome–Berlin Axis. A month later, Germany and Japan signed the Anti-Comintern Pact, which Italy would join in the following year.

Asia
The Kuomintang (KMT) party in China launched a unification campaign against regional warlords and nominally unified China in the mid-1920s, but was soon embroiled in a civil war against its former Chinese Communist Party allies[28] and new regional warlords. In 1931, an increasingly militaristic Empire of Japan, which had long sought influence in China[29] as the first step of what its government saw as the country's right to rule Asia, used the Mukden Incident as a pretext to launch an invasion of Manchuria and establish the puppet state of Manchukuo.[30]

Too weak to resist Japan, China appealed to the League of Nations for help. Japan withdrew from the League of Nations after being condemned for its incursion into Manchuria. The two nations then fought several battles, in Shanghai, Rehe and Hebei, until the Tanggu Truce was signed in 1933. Thereafter, Chinese volunteer forces continued the resistance to Japanese aggression in Manchuria, and Chahar and Suiyuan.[31] After the 1936 Xi'an Incident, the Kuomintang and communist forces agreed on a ceasefire to present a united front to oppose Japan.[32]

Pre-war events
Italian invasion of Ethiopia (1935)
Main article: Second Italo-Ethiopian War

Benito Mussolini inspecting troops during the Italo-Ethiopian War, 1935
The Second Italo–Ethiopian War was a brief colonial war that began in October 1935 and ended in May 1936. The war began with the invasion of the Ethiopian Empire (also known as Abyssinia) by the armed forces of the Kingdom of Italy (Regno d'Italia), which was launched from Italian Somaliland and Eritrea.[33] The war resulted in the military occupation of Ethiopia and its annexation into the newly created colony of Italian East Africa (Africa Orientale Italiana, or AOI); in addition it exposed the weakness of the League of Nations as a force to preserve peace. Both Italy and Ethiopia were member nations, but the League did nothing when the former clearly violated the League's Article X.[34] Germany was the only major European nation to openly support the invasion.[citation needed] Italy subsequently dropped its objections to Germany's goal of absorbing Austria.[35]

Spanish Civil War (1936–1939)
Main article: Spanish Civil War

The bombing of Guernica in 1937, during the Spanish Civil War, sparked Europe-wide fears that the next war would be based on bombing of cities with very high civilian casualties
When civil war broke out in Spain, Hitler and Mussolini lent military support to the Nationalist rebels, led by General Francisco Franco. The Soviet Union supported the existing government, the Spanish Republic. Over 30,000 foreign volunteers, known as the International Brigades, also fought against the Nationalists. Both Germany and the USSR used this proxy war as an opportunity to test in combat their most advanced weapons and tactics. The Nationalists won the civil war in April 1939; Franco, now dictator, remained officially neutral during World War II but generally favoured the Axis.[36] His greatest collaboration with Germany was the sending of volunteers to fight on the Eastern Front.[37]

Japanese invasion of China (1937)
Main article: Second Sino-Japanese War

Japanese Imperial Army soldiers during the Battle of Shanghai, 1937
In July 1937, Japan captured the former Chinese imperial capital of Peking after instigating the Marco Polo Bridge Incident, which culminated in the Japanese campaign to invade all of China.[38] The Soviets quickly signed a non-aggression pact with China to lend materiel support, effectively ending China's prior co-operation with Germany. From September to November, the Japanese attacked Taiyuan,[39][40] as well as engaging the Kuomintang Army around Xinkou[39][40] and Communist forces in Pingxingguan.[41][42] Generalissimo Chiang Kai-shek deployed his best army to defend Shanghai, but, after three months of fighting, Shanghai fell. The Japanese continued to push the Chinese forces back, capturing the capital Nanking in December 1937. After the fall of Nanking, tens of thousands if not hundreds of thousands of Chinese civilians and disarmed combatants were murdered by the Japanese.[43][44]

In March 1938, Nationalist Chinese forces won their first major victory at Taierzhuang but then the city of Xuzhou was taken by Japanese in May.[45] In June 1938, Chinese forces stalled the Japanese advance by flooding the Yellow River; this manoeuvre bought time for the Chinese to prepare their defences at Wuhan, but the city was taken by October.[46] Japanese military victories did not bring about the collapse of Chinese resistance that Japan had hoped to achieve; instead the Chinese government relocated inland to Chongqing and continued the war.[47][48]

Soviet–Japanese border conflicts

Red Army artillery unit during the Battle of Lake Khasan, 1938
Main article: Soviet–Japanese border conflicts
In the mid-to-late 1930s, Japanese forces in Manchukuo had sporadic border clashes with the Soviet Union and the Mongolian People's Republic. The Japanese doctrine of Hokushin-ron, which emphasised Japan's expansion northward, was favoured by the Imperial Army during this time. With the Japanese defeat at Khalkin Gol in 1939, the ongoing Second Sino-Japanese War[49] and ally Nazi Germany pursuing neutrality with the Soviets, this policy would prove difficult to maintain. Japan and the Soviet Union eventually signed a Neutrality Pact in April 1941, and Japan adopted the doctrine of Nanshin-ron, promoted by the Navy, which took its focus southward, eventually leading to its war with the United States and the Western Allies.[50][51]emp_test", "postId": 1 },
    { "id": 2, "body": "some comment", "postId": 1 }
  ],
  "profile": {
    "name": "typicode"
  }
}
